Tekla.Structures.Model.RebarPropertyModifier
The RebarPropertyModifier class represents a modifier that can modify the characteristics of Tekla.Structures.Model.RebarSet reinforcing bars that pass through it.
The following example shows how to create and add a RebarPropertyModifier, to a rebarset.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
// Create and insert a rebarset (see the RebarSet example).
var rebarSet = new RebarSet();
// Create the RebarPropertyModifier
var strip = new RebarPropertyModifier();
strip.Father = rebarSet;
strip.GroupingType = RebarPropertyModifier.GroupingTypeEnum.AUTOMATIC;
strip.RebarProperties.Name = "REBAR";
strip.RebarProperties.Class = 3;
strip.RebarProperties.Grade = "H";
strip.RebarProperties.Size = "12";
strip.RebarProperties.BendingRadius = 24;
strip.RebarProperties.NumberingSeries.StartNumber = 1;
strip.Curve.AddContourPoint(new ContourPoint(new Point(200, 200, 0), null));
strip.Curve.AddContourPoint(new ContourPoint(new Point(200, 1000, 0), null));
strip.Insert();
}
}

Tekla.Structures.Model.RebarPropertyModifier.ToStruct(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
The to struct.
dotStrip: The dot strip.

Tekla.Structures.Model.RebarPropertyModifier.FromStruct(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
The from struct.
dotStrip: The dot strip.